/*

< ▒т║╗╗ч╟╫ / │╗ ╝╥╜║ >
- ╜├░г ┴ж╟╤(1 ├╩ / 0 MS)
- ╕▐╕Ё╕о ┴ж╟╤(128 MB / 1984 KB)
- ╣о┴ж╕ж ╟м └№┐°└╟ ┴д┤ф ║ё└▓(74.884 %)

< ╣о┴ж >
JOI ═╘╬шк╬тгхЎк╦к╧гмў╝?╧╓гмєн?╧╓гм▀▓?╧╓гм▐╠?╧╓гм№гэнк╡кєк╬ 5 ь╤к╬▀ц╙∙км?╩ек╖к┐го
к│к╬тгхЎк╟к╧гм╤в╪╟у╦?кЄ?у┐к╖к┐го╤в╪╟у╦?к╧гм5 ь╤юяъмкмсЇ?к╖к┐го
╤в╪╟у╦?к╬я├?км 40 я├ьд▀╛к╬▀ц╙∙к╧гм╤в╪╟у╦?к╬я├?кмк╜к╬к▐к▐рўюрк╦к╩к├к┐го
╤в╪╟у╦?к╬я├?км 40 я├┌▒?к╬▀ц╙∙к╧юяъмгм▄═узкЄсЇк▒гмрўюркм 40 я├к╦к╩к├к┐го
5 ь╤к╬▀ц╙∙к╬╤в╪╟у╦?к╬я├?км?кикщкьк┐к╚кнгм5 ь╤к╬рўюрк╬°┴╨│я├кЄ═к▀йк╣кыл╫лэл░лщлркЄэ┬рўк╗кшго

< └╘╖┬ >
ь¤╒Їк╧ 5 ·╝клкщк╩къгм1 ·╝к╦ 1 к─к║к─я┌?км▀Ўклкьк╞кдкыго

- 1 ·╝┘═к╦к╧ ў╝?╧╓к╬╤в╪╟у╦?к╬я├?км▀Ўклкьк╞кдкыго
- 2 ·╝┘═к╦к╧ єн?╧╓к╬╤в╪╟у╦?к╬я├?км▀Ўклкьк╞кдкыго
- 3 ·╝┘═к╦к╧ ▀▓?╧╓к╬╤в╪╟у╦?к╬я├?км▀Ўклкьк╞кдкыго
- 4 ·╝┘═к╦к╧ ▐╠?╧╓к╬╤в╪╟у╦?к╬я├?км▀Ўклкьк╞кдкыго
- 5 ·╝┘═к╦к╧ №гэнк╡кєк╬╤в╪╟у╦?к╬я├?км▀Ўклкьк╞кдкыго

▀ц╙∙к╬╤в╪╟у╦?к╬я├?к╧к╣к┘к╞ 0 я├ьд▀╛ 100 я├ьд∙╗к╬я┌?к╟квкыго
▀ц╙∙к╬╤в╪╟у╦?к╬я├?к╧к╣к┘к╞ 5 к╬█├?к╟квкыго5 ь╤к╬▀ц╙∙к╬рўюрк╬°┴╨│я├к╧∙▒к║я┌?к╦к╩кыго

< ├т╖┬ >
5 ь╤к╬▀ц╙∙к╬рўюрк╬°┴╨│я├кЄквкщкяк╣я┌?кЄ 1 ·╝к╟їє╒Їк╗кшго

< ╚∙╞о >
ь¤їє╒Ї╓╟ к╟к╧гмў╝?╧╓к╚▐╠?╧╓к╬╤в╪╟у╦?к╬я├?к╧ 40 я├┌▒?к╩к╬к╟гмў╝?╧╓к╚▐╠?╧╓к╬рўюрк╧ 40 я├к╦к╩кыго
єн?╧╓к╚▀▓?╧╓к╚№гэнк╡кєк╬╤в╪╟у╦?к╬я├?к╧ 40 я├ьд▀╛к╩к╬к╟гмєн?╧╓к╬рўюрк╧ 65 я├гм▀▓?╧╓к╬рўюрк╧ 100 я├гм№гэнк╡кєк╬рўюрк╧ 95 я├к╚к╩кыго
5 ь╤к╬рўюрк╬∙ъ═кк╧ 340 к╩к╬к╟гм°┴╨│я├к╧ 68 я├к╚к╩кыго

< ├т├│ >
Olympiad > └╧║╗┴д║╕┐├╕▓╟╟╛╞╡х ┐╣╝▒ > JOI 2014 ┐╣╝▒ 1╣°

< ╛╦░э╕о┴Є ║╨╖∙ >
- ▒╕╟Ў

*/

#include <iostream>

using namespace std;

int main()
{
	int score, sum = 0;

	for (int i = 0; i < 5; i++)
	{
		cin >> score;

		if (score < 40) // 40┴б ╣╠╕╕└╧ ░ц┐ь ║╕├ц╟╨╜└└╕╖╬ └╬╟╪ 40┴б└╠ ╡╩
			score = 40;

		sum += score;
	}

	cout << sum / 5 << endl;
}