/*

< ▒т║╗╗ч╟╫ / │╗ ╝╥╜║ >
- ╜├░г ┴ж╟╤(1 ├╩ / 0 MS)
- ╕▐╕Ё╕о ┴ж╟╤(256 MB / 1984 KB)
- ╣о┴ж╕ж ╟м └№┐°└╟ ┴д┤ф ║ё└▓(75.352 %)

< ╣о┴ж >
JOI ╧╓кмёмкєк╟кдкыЄвц┤к╦к╧тй╘│?▐фкм X ▐фк╚ Y ▐фк╬ 2 к─квкыго2 к─к╬?▐фк╬ 1 лЎъ┼к╬тй╘│╓∙╤╤к╧гм1 лЎъ┼к╬тй╘│к╬▐┼щ─╒ск╦?к╕к╞єнк╬кшкжк╦╠╜к▐кыго

- X ▐фг║ 1 лъл├л╚лы квк┐къ A хўклклкыго
- Y ▐фг║ ╨ё▄т╓∙╤╤к╧ B хўк╟квкыго▐┼щ─╒скм C лъл├л╚лыьд∙╗к╩кщк╨гм╓∙╤╤к╧╨ё▄т╓∙╤╤ B хўк╬к▀кмклклкыго
▐┼щ─╒скм C лъл├л╚лыкЄї▒кикык╚╨ё▄т╓∙╤╤ B хўк╦╩екик╞ї┌╩е╓∙╤╤кмклклкыгої┌╩е╓∙╤╤к╧▐┼щ─╒скм C лъл├л╚лыкЄ 1 лъл├л╚лыї▒кикык┤к╚к╦ D хўк╟квкыго

JOI ╧╓к╬╩лк╟к╧ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒скм P лъл├л╚лык╟квкыго
тй╘│╓∙╤╤кмк╟кнкык└к▒ф╠кпк╩кыкшкжк╦тй╘│?▐фкЄр╘к╓к╚кнгмJOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│╓∙╤╤кЄ╧┤кскшго

< └╘╖┬ >
ь¤╒Їк╧ 5 ·╝клкщк╩къгм1 ·╝к╦ 1 к─к║к─я┌?км▀Ўклкьк╞кдкыго

- 1 ·╝┘═к╦к╧ X ▐фк╬ 1 лъл├л╚лыквк┐кък╬╓∙╤╤ A км▀Ўклкьк╞кдкыго
- 2 ·╝┘═к╦к╧ Y ▐фк╬╨ё▄т╓∙╤╤ B км▀Ўклкьк╞кдкыго
- 3 ·╝┘═к╦к╧ Y ▐фк╬╓∙╤╤км╨ё▄т╓∙╤╤к╬к▀к╦к╩кы▐┼щ─╒ск╬▀╛∙┌ C км▀Ўклкьк╞кдкыго
- 4 ·╝┘═к╦к╧ Y ▐фк╬ 1 лъл├л╚лыквк┐кък╬ї┌╩е╓∙╤╤ D км▀Ўклкьк╞кдкыго
- 5 ·╝┘═к╦к╧ JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒с P км▀Ўклкьк╞кдкыго

▀Ўклкьк╞кдкыя┌? A, B, C, D, P к╧к╣к┘к╞ 1 ьд▀╛ 10000 ьд∙╗к╟квкыго

< ├т╖┬ >
JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│╓∙╤╤кЄ°·к╣я┌?кЄ 1 ·╝к╟їє╒Їк╗кшго

< ╚∙╞о >
ь¤їє╒Ї╓╟ 1 к╟к╧гмJOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒ск╧ 10 лъл├л╚лык╟квкыго

- X ▐фк╬тй╘│╓∙╤╤к╧ 9 б┐ 10 = 90 хўк╟квкыго
- JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒ск╧ 20 лъл├л╚лыьд∙╗к╩к╬к╟гмY ▐фк╬тй╘│╓∙╤╤к╧╨ё▄т╓∙╤╤к╬ 100 хўк╟квкыго

JOI ╧╓к╬╩лк╧тй╘│╓∙╤╤кмкшкъф╠кд X ▐фкЄр╘к╓гок╜к╬к╚кнк╬ JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│╓∙╤╤к╧ 90 хўк╟квкыго
ь¤їє╒Ї╓╟ 2 к╟к╧гмJOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒ск╧ 250 лъл├л╚лык╟квкыго

- X ▐фк╬тй╘│╓∙╤╤к╧ 8 б┐ 250 = 2000 хўк╟квкыго
- JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│к╬▐┼щ─╒ск╧ 100 лъл├л╚лыьд▀╛к╟гмї▒╬ж╒ск╧ 250 - 100 = 150 лъл├л╚лык╟квкыгокшк├к╞гм
Y ▐фк╬тй╘│╓∙╤╤к╧╨ё▄т╓∙╤╤к╬ 300 хўк╦╩екик╞ 10 б┐ 150 = 1500 хўк╬ї┌╩е╓∙╤╤кмклклкъгм∙ъ═кк╬тй╘│╓∙╤╤к╧ 300 + 1500 = 1800 хўк╟квкыго

JOI ╧╓к╬╩лк╧тй╘│╓∙╤╤кмкшкъф╠кд Y ▐фкЄр╘к╓гок╜к╬к╚кнк╬ JOI ╧╓к╬╩лк╬ 1 лЎъ┼к╬тй╘│╓∙╤╤к╧ 1800 хўк╟квкыго
б╪╩└ь¤їє╒Ї╓╟к╬л╟?л┐к╧гмщ╙лплъл├лп╘їк╦кшкъл╒лблдлык╦▄┴Ёэк╖к╞╫╫щ─╩ж╥Ўк╟к╣го

< ├т├│ >
Olympiad > └╧║╗┴д║╕┐├╕▓╟╟╛╞╡х ┐╣╝▒ > JOI 2015 ┐╣╝▒ 1╣°

< ╛╦░э╕о┴Є ║╨╖∙ >
- ▒╕╟Ў

*/

#include <iostream>

using namespace std;

int main(void)
{
	int baseCostX; // X╗ч└╟ 1╕о┼═┤ч ┐ф▒▌
	int baseCostY, useLimit, addCost; // ▒т║╗┐ф▒▌░· ▒т║╗┐ф▒▌└╠ ├╗▒╕╡╟┤┬ ├╓┤ы╗ч┐ы╖о, 1╕о┼═┤ч ├▀░б┐ф▒▌
	int useWater; // ╜╟┴ж╖╬ ╗ч┐ы╟╤ ▒▌╛╫
	int finalCostX, finalCostY; // ░ш╗ъ╟╪ ║╕╛╥└╗ ╢з ░в░в ╚╕╗ч░б ├╗▒╕╟╥ ▒▌╛╫

	cin >> baseCostX >> baseCostY >> useLimit >> addCost >> useWater;

	finalCostX = baseCostX * useWater;

	if (useWater > useLimit)
		finalCostY = baseCostY + (useWater - useLimit) * addCost;

	else finalCostY = baseCostY;

	if (finalCostX > finalCostY)
		cout << finalCostY << endl;

	else cout << finalCostX << endl;
}